Revit 2024 API
KeyBasedTreeEntriesLoadContent.GetLoadResults Method
 Returns a copy of the KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public KeyBasedTreeEntriesLoadResults GetLoadResults()
Visual Basic
Public Function GetLoadResults As KeyBasedTreeEntriesLoadResults
Visual C++
public:
KeyBasedTreeEntriesLoadResults^ GetLoadResults()
Return Value
 A copy of a KeyBasedTreeEntriesLoadResults owned by this KeyBasedTreeEntriesLoadContent object.
Remarks
 IExternalResourceServers can use this object to report data and results back to Revit from their LoadResource methods.
See Also
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace